xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_comp.h
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup COMP_Exported_Constants COMP Exported Constants
  * @{
  */

/** @defgroup COMP_Error_Code COMP Error Code
  * @{
  */
#define HAL_COMP_ERROR_NONE             (0x00UL)  /*!< No error */
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
#define HAL_COMP_ERROR_INVALID_CALLBACK (0x01UL)  /*!< Invalid Callback error */
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup COMP_WindowMode COMP Window Mode
  * @{
  */
#define COMP_WINDOWMODE_DISABLE                 (0x00000000UL)         /*!< Window mode disable: Comparators instances pair COMP1 and COMP2 are independent */
#define COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | COMP_WINDOWMODE_COMP1) /*!< Window mode enable: Comparators instances pair COMP1 and COMP2 have their input plus connected together. The common input is COMP1 input plus (COMP2 input plus is no more accessible). */
#define COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | COMP_WINDOWMODE_COMP2) /*!< Window mode enable: Comparators instances pair COMP1 and COMP2 have their input plus connected together. The common input is COMP2 input plus (COMP1 input plus is no more accessible). */

/**
  * @}
  */

/** @defgroup COMP_PowerMode COMP power mode
  * @{
  */
/* Note: For the characteristics of comparator power modes                    */
/*       (propagation delay and power consumption),                           */
/*       refer to device datasheet.                                           */
#define COMP_POWERMODE_HIGHSPEED       (0x00000000UL)         /*!< High Speed */
#define COMP_POWERMODE_MEDIUMSPEED     (COMP_CSR_PWRMODE)   /*!< Medium Speed */
/**
  * @}
  */

/** @defgroup COMP_InputPlus COMP input plus (non-inverting input)
  * @{
  */ 
#define COMP_INPUT_PLUS_INTERNAL0  (0x00000000UL)                                                 /*!< Comparator input plus connected to internal analog module(OPA OUT for COMP1, DAC OUT for COMP2) */
#define COMP_INPUT_PLUS_INTERNAL1  (COMP_CSR_INPSEL_0)                                            /*!< Comparator input plus connected to internal analog module(DAC OUT for COMP1, OPA OUT for COMP2) */
#define COMP_INPUT_PLUS_IO0        (COMP_CSR_INPSEL_1)                                            /*!< Comparator input plus connected to IO0(pin PC15 for COMP1, pin PB14 for COMP2) */
#define COMP_INPUT_PLUS_IO1        (COMP_CSR_INPSEL_0 | COMP_CSR_INPSEL_1)                        /*!< Comparator input plus connected to IO1(pin PD0 for COMP1, pin PC3 for COMP2) */
#define COMP_INPUT_PLUS_IO2        (COMP_CSR_INPSEL_2)                                            /*!< Comparator input plus connected to IO2(pin PD1 for COMP1, pin PC4 for COMP2) */

/**
  * @}
  */

/** @defgroup COMP_InputMinus COMP input minus (inverting input)
  * @{
  */
#define COMP_INPUT_MINUS_IO0        (0x00000000UL)                                              /*!< Comparator input minus connected to IO0(pin PC5 for COMP1, pin PA13 for COMP2) */
#define COMP_INPUT_MINUS_IO1        (                                        COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to IO1(pin PA1 for COMP1, pin PB15 for COMP2) */
#define COMP_INPUT_MINUS_DAC_VOUT   (                    COMP_CSR_INMSEL_1                    ) /*!< Comparator input minus connected to internal analog module(DAC VOUT for all) */ 
#define COMP_INPUT_MINUS_VREFCMP    (                    COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to internal analog module(VREFCMP for all) */
#define COMP_INPUT_MINUS_TS_VIN     (COMP_CSR_INMSEL_2                                        ) /*!< Comparator input minus connected to internal analog module(TS_VIN for all) */ 
#define COMP_INPUT_MINUS_VREFINT    (COMP_CSR_INMSEL_2                     | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to internal analog module(VREFINT for all) */ 
#if defined(VREFBUF)
#define COMP_INPUT_MINUS_VREFBUF    (COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1                    ) /*!< Comparator input minus connected to internal analog module(VREFBUF for all) */ 
#endif
#define COMP_INPUT_MINUS_IO2        (COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to IO2(pin PA13 for COMP1, pin PC0 for COMP2) */

/**
  * @}
  */

/** @defgroup COMP_VrefSrc COMP Vref Source
  * @{
  */
#define COMP_VREF_SOURCE_VCC            (COMP_CCSR_SSEL) 
#if defined(VREFBUF)  
#define COMP_VREF_SOURCE_VREFBUF1P024V  (VREFBUF_CR_VREFBUF_EN)                                                                   /* Vrefbuf 1.024V */  
#define COMP_VREF_SOURCE_VREFBUF1P5V    (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL_0)                                    /* Vrefbuf 1.5V */  
#define COMP_VREF_SOURCE_VREFBUF2P048V  (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL_1)                                    /* Vrefbuf 2.048V */  
#define COMP_VREF_SOURCE_VREFBUF2P5V    (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL_1 | VREFBUF_CR_VREFBUF_OUT_SEL_0)     /* Vrefbuf 2.5V */  
#define COMP_VREF_SOURCE_VREFBUF0P6V    (VREFBUF_CR_VREFBUF_EN | VREFBUF_CR_VREFBUF_OUT_SEL_2)                                    /* Vrefbuf 0.6V */  
#endif
/**
  * @}
  */

/** @defgroup COMP_VrefDiv COMP Vref Div
  * @{
  */
#define COMP_VREFCMP_DIV_1_64VREFCMP    (0x00000000U)
#define COMP_VREFCMP_DIV_2_64VREFCMP    (                                                                                                    COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_3_64VREFCMP    (                                                                                COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_4_64VREFCMP    (                                                                                COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_5_64VREFCMP    (                                                            COMP_CCSR_VCDIV_2                                        )
#define COMP_VREFCMP_DIV_6_64VREFCMP    (                                                            COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_7_64VREFCMP    (                                                            COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_8_64VREFCMP    (                                                            COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_9_64VREFCMP    (                                        COMP_CCSR_VCDIV_3                                                            )
#define COMP_VREFCMP_DIV_10_64VREFCMP   (                                        COMP_CCSR_VCDIV_3                                         | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_11_64VREFCMP   (                                        COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_12_64VREFCMP   (                                        COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_13_64VREFCMP   (                                        COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                                        )
#define COMP_VREFCMP_DIV_14_64VREFCMP   (                                        COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_15_64VREFCMP   (                                        COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_16_64VREFCMP   (                                        COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_17_64VREFCMP   (                    COMP_CCSR_VCDIV_4                                                                                )
#define COMP_VREFCMP_DIV_18_64VREFCMP   (                    COMP_CCSR_VCDIV_4                                                             | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_19_64VREFCMP   (                    COMP_CCSR_VCDIV_4                                         | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_20_64VREFCMP   (                    COMP_CCSR_VCDIV_4                                         | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_21_64VREFCMP   (                    COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2                                        )
#define COMP_VREFCMP_DIV_22_64VREFCMP   (                    COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_23_64VREFCMP   (                    COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_24_64VREFCMP   (                    COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_25_64VREFCMP   (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                                                            )
#define COMP_VREFCMP_DIV_26_64VREFCMP   (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                                         | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_27_64VREFCMP   (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_28_64VREFCMP   (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_29_64VREFCMP   (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                                        )
#define COMP_VREFCMP_DIV_30_64VREFCMP   (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_31_64VREFCMP   (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_32_64VREFCMP   (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_33_64VREFCMP   (COMP_CCSR_VCDIV_5                                                                                                    )
#define COMP_VREFCMP_DIV_34_64VREFCMP   (COMP_CCSR_VCDIV_5                                                                                 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_35_64VREFCMP   (COMP_CCSR_VCDIV_5                                                             | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_36_64VREFCMP   (COMP_CCSR_VCDIV_5                                                             | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_37_64VREFCMP   (COMP_CCSR_VCDIV_5                                         | COMP_CCSR_VCDIV_2                                        )
#define COMP_VREFCMP_DIV_38_64VREFCMP   (COMP_CCSR_VCDIV_5                                         | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_39_64VREFCMP   (COMP_CCSR_VCDIV_5                                         | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_40_64VREFCMP   (COMP_CCSR_VCDIV_5                                         | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_41_64VREFCMP   (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3                                                            )
#define COMP_VREFCMP_DIV_42_64VREFCMP   (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3                                         | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_43_64VREFCMP   (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_44_64VREFCMP   (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_45_64VREFCMP   (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                                        )
#define COMP_VREFCMP_DIV_46_64VREFCMP   (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_47_64VREFCMP   (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_48_64VREFCMP   (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_49_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                                                                                )
#define COMP_VREFCMP_DIV_50_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                                                             | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_51_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                                         | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_52_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                                         | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_53_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2                                        )
#define COMP_VREFCMP_DIV_54_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_55_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_56_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_57_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                                                            )
#define COMP_VREFCMP_DIV_58_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                                         | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_59_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_60_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_61_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                                        )
#define COMP_VREFCMP_DIV_62_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)
#define COMP_VREFCMP_DIV_63_64VREFCMP   (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )
#define COMP_VREFCMP_DIV_VREFCMP        (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)

/**
  * @}
  */

